In [11]:
from MySQL_model import MysqlDB
import pandas as pd
import pymysql

In [12]:
# 连接MySQL数据库
mysqldb = MysqlDB('localhost', 'qwer123456', 'myemployees')

In [13]:
sql_select = """
select e.employee_id,
       e.last_name,
       m.employee_id,
       m.last_name
from employees e,
     employees m
where e.`manager_id` = m.`employee_id`;"""

data, columns = (), []
try:
    data, columns = mysqldb.fetch_data(sql_select)
except pymysql.Error as e:
    print("数据查询失败: " + str(e))
finally:
    # 关闭数据库连接
    mysqldb.close_con()

106  of affected rows!

In [14]:
# 元组
data

((101, 'Kochhar', 100, 'K_ing'),
 (102, 'De Haan', 100, 'K_ing'),
 (103, 'Hunold', 102, 'De Haan'),
 (104, 'Ernst', 103, 'Hunold'),
 (105, 'Austin', 103, 'Hunold'),
 (106, 'Pataballa', 103, 'Hunold'),
 (107, 'Lorentz', 103, 'Hunold'),
 (108, 'Greenberg', 101, 'Kochhar'),
 (109, 'Faviet', 108, 'Greenberg'),
 (110, 'Chen', 108, 'Greenberg'),
 (111, 'Sciarra', 108, 'Greenberg'),
 (112, 'Urman', 108, 'Greenberg'),
 (113, 'Popp', 108, 'Greenberg'),
 (114, 'Raphaely', 100, 'K_ing'),
 (115, 'Khoo', 114, 'Raphaely'),
 (116, 'Baida', 114, 'Raphaely'),
 (117, 'Tobias', 114, 'Raphaely'),
 (118, 'Himuro', 114, 'Raphaely'),
 (119, 'Colmenares', 114, 'Raphaely'),
 (120, 'Weiss', 100, 'K_ing'),
 (121, 'Fripp', 100, 'K_ing'),
 (122, 'Kaufling', 100, 'K_ing'),
 (123, 'Vollman', 100, 'K_ing'),
 (124, 'Mourgos', 100, 'K_ing'),
 (125, 'Nayer', 120, 'Weiss'),
 (126, 'Mikkilineni', 120, 'Weiss'),
 (127, 'Landry', 120, 'Weiss'),
 (128, 'Markle', 120, 'Weiss'),
 (129, 'Bissot', 121, 'Fripp'),
 (130, 'Atkinson', 121, 'Fripp'),
 (131, 'Marlow', 121, 'Fripp'),
 (132, 'Olson', 121, 'Fripp'),
 (133, 'Mallin', 122, 'Kaufling'),
 (134, 'Rogers', 122, 'Kaufling'),
 (135, 'Gee', 122, 'Kaufling'),
 (136, 'Philtanker', 122, 'Kaufling'),
 (137, 'Ladwig', 123, 'Vollman'),
 (138, 'Stiles', 123, 'Vollman'),
 (139, 'Seo', 123, 'Vollman'),
 (140, 'Patel', 123, 'Vollman'),
 (141, 'Rajs', 124, 'Mourgos'),
 (142, 'Davies', 124, 'Mourgos'),
 (143, 'Matos', 124, 'Mourgos'),
 (144, 'Vargas', 124, 'Mourgos'),
 (145, 'Russell', 100, 'K_ing'),
 (146, 'Partners', 100, 'K_ing'),
 (147, 'Errazuriz', 100, 'K_ing'),
 (148, 'Cambrault', 100, 'K_ing'),
 (149, 'Zlotkey', 100, 'K_ing'),
 (150, 'Tucker', 145, 'Russell'),
 (151, 'Bernstein', 145, 'Russell'),
 (152, 'Hall', 145, 'Russell'),
 (153, 'Olsen', 145, 'Russell'),
 (154, 'Cambrault', 145, 'Russell'),
 (155, 'Tuvault', 145, 'Russell'),
 (156, 'K_ing', 146, 'Partners'),
 (157, 'Sully', 146, 'Partners'),
 (158, 'McEwen', 146, 'Partners'),
 (159, 'Smith', 146, 'Partners'),
 (160, 'Doran', 146, 'Partners'),
 (161, 'Sewall', 146, 'Partners'),
 (162, 'Vishney', 147, 'Errazuriz'),
 (163, 'Greene', 147, 'Errazuriz'),
 (164, 'Marvins', 147, 'Errazuriz'),
 (165, 'Lee', 147, 'Errazuriz'),
 (166, 'Ande', 147, 'Errazuriz'),
 (167, 'Banda', 147, 'Errazuriz'),
 (168, 'Ozer', 148, 'Cambrault'),
 (169, 'Bloom', 148, 'Cambrault'),
 (170, 'Fox', 148, 'Cambrault'),
 (171, 'Smith', 148, 'Cambrault'),
 (172, 'Bates', 148, 'Cambrault'),
 (173, 'Kumar', 148, 'Cambrault'),
 (174, 'Abel', 149, 'Zlotkey'),
 (175, 'Hutton', 149, 'Zlotkey'),
 (176, 'Taylor', 149, 'Zlotkey'),
 (177, 'Livingston', 149, 'Zlotkey'),
 (178, 'Grant', 149, 'Zlotkey'),
 (179, 'Johnson', 149, 'Zlotkey'),
 (180, 'Taylor', 120, 'Weiss'),
 (181, 'Fleaur', 120, 'Weiss'),
 (182, 'Sullivan', 120, 'Weiss'),
 (183, 'Geoni', 120, 'Weiss'),
 (184, 'Sarchand', 121, 'Fripp'),
 (185, 'Bull', 121, 'Fripp'),
 (186, 'Dellinger', 121, 'Fripp'),
 (187, 'Cabrio', 121, 'Fripp'),
 (188, 'Chung', 122, 'Kaufling'),
 (189, 'Dilly', 122, 'Kaufling'),
 (190, 'Gates', 122, 'Kaufling'),
 (191, 'Perkins', 122, 'Kaufling'),
 (192, 'Bell', 123, 'Vollman'),
 (193, 'Everett', 123, 'Vollman'),
 (194, 'McCain', 123, 'Vollman'),
 (195, 'Jones', 123, 'Vollman'),
 (196, 'Walsh', 124, 'Mourgos'),
 (197, 'Feeney', 124, 'Mourgos'),
 (198, 'OConnell', 124, 'Mourgos'),
 (199, 'Grant', 124, 'Mourgos'),
 (200, 'Whalen', 101, 'Kochhar'),
 (201, 'Hartstein', 100, 'K_ing'),
 (202, 'Fay', 201, 'Hartstein'),
 (203, 'Mavris', 101, 'Kochhar'),
 (204, 'Baer', 101, 'Kochhar'),
 (205, 'Higgins', 101, 'Kochhar'),
 (206, 'Gietz', 205, 'Higgins'))

In [15]:
# 列表
columns

['employee_id', 'last_name', 'employee_id', 'last_name']

In [16]:
pd.DataFrame(data, columns=columns)

     employee_id last_name  employee_id  last_name
0            101   Kochhar          100      K_ing
1            102   De Haan          100      K_ing
2            103    Hunold          102    De Haan
3            104     Ernst          103     Hunold
4            105    Austin          103     Hunold
..           ...       ...          ...        ...
101          202       Fay          201  Hartstein
102          203    Mavris          101    Kochhar
103          204      Baer          101    Kochhar
104          205   Higgins          101    Kochhar
105          206     Gietz          205    Higgins

[106 rows x 4 columns]

In [17]:
sql_insert = """
insert into book
select 7, 'go', 50;
"""

try:
    mysqldb.change_data(sql_insert)
except pymysql.Error as e:
    print("数据更新失败: " + str(e))
    # 发生错误时回滚
    mysqldb.rollback()
finally:
    # 关闭数据库连接
    mysqldb.close_con()

数据更新失败: (1146, "Table 'myemployees.book' doesn't exist")